attentionMessage = 'Данный бот задумывается разработчиком, как чат-бот для общения. На данный момент бот глуп и формирует свои вопросы' \
                   'полностью на основе предыдущего ответа пользователя. Пожалуйста, отвечайте так, как действительно хотели бы поговорить с реальным человеком. ' \
                   'Это необходимо для того, чтобы собрать набор диалогов, на основе которых бот сможет обучаться и говорить более разнообразно.\n' \
                   'Если диалог становится бессмысленным, напишите слово Стоп, и бот перейдет к следующему вопросу. Пожалуйста, не создавайте диалоги, не имеющие смысла.\n' \
                   'Большое спасибо за Ваше участие!'

welcomeMessage = 'Привет. Меня зовут Витя. Я чат-бот для общения.\n ' \
                 'Я предлагаю Вам ответить на несколько вопросов. Приведите в ответном сообщении все варианты, которые только придут вам в голову.\n ' \
                 'Начинайте каждый ответ с нового предложения.'

listQuestions = ['Зачем люди смотрят телевизор?', 'Зачем люди едят?', 'Зачем люди ходят на работу?', 'Зачем люди лгут?',
                 'Зачем люди путешествуют?']

stopSentence = ['я не знаю', 'мне надоело', 'хватит', 'прекрати', 'стоп', 'я устал', 'не знаю', 'хз', 'отстань']

endMessage = 'Мы хорошо пообщались! Спасибо тебе)\n' \
             'Если захочешь пообщаться вновь, перезапусти наш диалог, введя команду /start'

askAge = 'Сколько тебе лет?'
askGender = 'Ты мужчина или женщина?'

answerAge = 'Здорово! А меня создали не так давно'